metaneutrons/Vellum/firmware/sdkconfig.defaults.s3
# Vellum Firmware — ESP32-S3 (E-Paper: E1001, E1002, E1003)
CONFIG_IDF_TARGET="esp32s3"

# E1001 uses USB-Serial-JTAG for logs, the text console, and Improv
# provisioning. E1002 and E1003 expose UART0 through onboard CH34x bridges, so
# their model overlays replace this default. P4 (sdkconfig.defaults.p4) also
# uses native USB-Serial-JTAG.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Flash / partition
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# NVS
CONFIG_NVS_ENCRYPTION=n

# Wi-Fi (native, no remote)
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_REMOTE_ENABLED=n

# GPIO sleep config
CONFIG_GPIO_ESP32_SUPPORT_SWITCH_SLP_PULL=n
CONFIG_PM_SLP_IRAM_OPT=n

# HTTP server (captive portal)
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# HTTP client — enterprise transport: HTTPS required, validate the server
# certificate against the bundled CA roots (esp_crt_bundle). The firmware
# refuses to send the device token over plaintext.
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# Support modern public-CA chains that include a cross-signed root (for
# example the current Let's Encrypt YR chain) without weakening validation.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y

# Secure TLS requires a valid clock. Prefer NTP advertised by DHCP (option 42)
# and retain room for public fallback servers on networks without that option.
CONFIG_LWIP_DHCP_GET_NTP_SRV=y
CONFIG_LWIP_DHCP_MAX_NTP_SERVERS=1
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# PSRAM (8MB on reTerminal E-Series)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256

# Main task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# LVGL
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# OTA rollback (see ota_manager_mark_valid)
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
